// dllmain.cpp : Defines the entry point for the DLL application.
#include "pch.h"

#include "include/client_ws.hpp"
#include "include/server_ws.hpp"
#include <future>

#include "SdkHeaders.hpp";
#include <iostream>
#include <fstream>
#include "MinHook.h"
#include "winsock.h";
#include "Hedera.hpp"
#include <chrono>
#include <future>
#include <deque>

using WsServer = SimpleWeb::SocketServer<SimpleWeb::WS>;
using WsClient = SimpleWeb::SocketClient<SimpleWeb::WS>;


size_t base_address = 0;

typedef int(__fastcall* CrashFunc)(UObject* param_1, int* param_2, UObject* param_3, char param_4);

CrashFunc originalCrashFunc = 0;

typedef UObject* (__fastcall* StaticConstructObject)(UClass*, size_t, size_t, size_t, size_t, size_t, size_t, size_t, size_t);

StaticConstructObject origStaticConstructObject = 0;

size_t static_construct_object_param_9 = 0;

/*
unsafe fn fake_notify_accepting_connection(world: usize) -> u8{
	type NotifyAcceptingConnection = unsafe extern "thiscall" fn(world: usize) -> u8;

	let notify_accepting_connection: NotifyAcceptingConnection = unsafe{ std::mem::transmute(orig_world_control_message_recieved)};

	//let mut returnVal: u8 = notify_accepting_connection(world);

	//println!("NotifyAcceptingConnection: {}", returnVal);
	println!("Intercepting NotifyAcceptingConnection! Modifying...");

	let returnVal = 1;

	return returnVal;
}*/

bool listening = false;

template<typename T>
std::vector<T*> getAllObjectsOfType() {
	std::vector<T*> items = std::vector<T*>();

	for (UObject* obj : *GObjects) {
		if (obj && obj->IsA<T>()) {
			items.push_back((T*)obj);
		}
	}

	return items;
}

template<typename T>
T* getLastOfType() {
	return getAllObjectsOfType<T>().back();
}

template<typename T>
void listAllObjectsOfType() {
	std::vector<T*> items = getAllObjectsOfType<T>();

	for (T* item : items) {
		std::cout << std::hex << ((__int64)item) << std::endl;
		std::cout << ((UObject*)item)->GetFullName() << std::endl;
	}
}

UObject* NewObject(UClass* classToInstantiate, UObject* parent) {
	if (static_construct_object_param_9)
		return reinterpret_cast<UObject * (*)(UClass*, UObject*, size_t, size_t, size_t, size_t, size_t, size_t, size_t)>(base_address + 0x008c050)(classToInstantiate, parent, 0, 0, 0, 0, 0, 0, static_construct_object_param_9);
	else {
		std::cout << "Failed to create object: param9 null!" << std::endl;
		return nullptr;
	}
}

void* gbx_malloc(size_t size) {
	int* param_1 = reinterpret_cast<int* (*)()>(base_address + 0x0d33260)();

	return reinterpret_cast<void* (*)(unsigned int param_1, size_t param_2, size_t param_3, size_t param_4, size_t param_5, unsigned int param_6, unsigned int param_7, const char* param_8, unsigned int param_9,const char* param_10)>(base_address + 0x0d2e160)(*(int*)(param_1 + 0x10), 0, size, 0x8, 0, 0, 0x31c0019,
		"t:\\POPLAR-PATCH-PC\\Development\\Src\\Core\\Src\\gbxmem.cpp", 0x46, "appMalloc");
	/*  lVar1 = FUN_140d33260();
  FUN_140d2e160(*(undefined4 *)(lVar1 + 0x10),0,param_2,0x10,0,0,0x31c0019,
                "t:\\POPLAR-PATCH-PC\\Development\\Src\\Core\\Src\\gbxmem.cpp",0x46,"appMalloc");*/
}

void FlushNet(UNetConnection* connection, bool bIgnoreSimulation) {
	// was 0x0163410
	//now 061b9e0
	reinterpret_cast<void (*)(UNetConnection * connection, bool bIgnoreSimulation)>(base_address + 0x061b9e0)(connection, bIgnoreSimulation);
}

struct FOutBunch {
	char UnknownData[0x50]; //0x0
	TArray<uint8_t> Data; //0x50
	int Num; //0x60
	int Max; //0x64
	FOutBunch* Next; //0x68
	char UnknownData01[0x8]; //0x70
	double Time; //0x78
	signed int RecievedAck; //0x80
	int ChIndex; //0x84
	int ChType; //0x88
	int ChSequence; //0x8c
	int PacketId; //0x90
	char bOpen; //0x94
	char bClose; //0x95
	char bReliable; //0x96
};

FOutBunch ConstructChallengeBunch(UTcpipConnection* connection, UControlChannel* controlChannel) {
	FOutBunch returnVal = FOutBunch();

	returnVal.bReliable = true;
	returnVal.bClose = false;
	returnVal.ChIndex = controlChannel->ChIndex;
	returnVal.ChType = controlChannel->ChType;

	//0x21AF - af 21

	returnVal.Data = TArray<uint8_t>();

	for (int i = 0; i < ((512 * 8) - 64 - 1 - 16); i++) {
		returnVal.Data.push_back(0x0);
	}

	returnVal.Data[0] = 0x3; //0x3 = Challenge bunch type
	returnVal.Data[1] = 0xAF; //Version
	returnVal.Data[2] = 0x21; //Version
	
	//returnVal.Data.push_back(0x00); //Challenge String

	returnVal.Num = returnVal.Data.size();
	returnVal.Max = returnVal.Data.size();

	return returnVal;
}

int ControlChannelSendBunch(UControlChannel* channel, FOutBunch* bunch, bool merge) {
	return reinterpret_cast<int (*)(UControlChannel * channel, FOutBunch * bunch, bool merge)>(base_address + 0x0610cf0)(channel, bunch, merge);
}

